Revit 2027 API
Grid.IsCurved Property
 Identifies if the grid line is curved or straight.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsCurved { get; }
Public ReadOnly Property IsCurved As Boolean
	Get
public:
property bool IsCurved {
	bool get ();
}
member IsCurved : bool with get
Property Value
Boolean
Remarks
 A value of True is returned if the grid line is an arc or False if the grid line is straight. Use the Curve property to retrieve an object that represents the geometry of the grid line.
See Also
Reference
Grid Class
Autodesk.Revit.DB Namespace